Лабораторная работа №1
Написать программу «Hello, world!»

Лабораторная работа №2
Отсортировать символы в строке по значению ASCII кода символа.

Лабораторная работа №3
Перевести число из одной системы счисления в другую (системы счисления задаются до ввода-вывода числа в диапазоне [2..16]).

Лабораторная работа №4
Игра «Змейка».

Лабораторная работа №5
Параметры обработки (включая описание путей к файлам) передавать в программу через параметры командной строки.

Лабораторная работа №6
Ввести массив чисел с плавающей точкой на 10 элементов. Вычислить сумму элементов массива.

Лабораторная работа №7
Написать программу, запускающую другую программу N раз (N – число в диапазоне [1, 255]). Имя запускаемой программы задается константой.

Лабораторная работа №8
Написать программу вывода строк текста из файла с обработчиком прерывания Ctrl-Break (Ctrl-C). При нажатии Ctrl-C программа должна приостановить вывод данных на экран (до нажатия любой клавиши).
